The-Emacs-Multimedia-System.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-07 Sat 14:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-org55a1f13" class="outline-2">
<h2 id="org55a1f13">The Emacs Multimedia System</h2>
<div class="outline-text-2" id="text-org55a1f13">
</div>
<div id="outline-container-org1cc4c0e" class="outline-3">
<h3 id="org1cc4c0e">Why ?</h3>
<div class="outline-text-3" id="text-org1cc4c0e">
<p>
Music is a big part of my workflow, and for the majority of it i use <i>spotify</i>, but sometimes its not enough, or some of the content that I want is not available on there and I have to buy and stream from <a href="https://bandcamp.com/jxtx_">Bandcamp</a>. This is a tedious "solution", and yes <i>spotify</i> does support playing local files, but how about on systems that i've not installed <i>spotify</i> on? 
</p>

<p>
I spend the majority of my workflow within an emacs buffer, and I looked into solutions to have <code>Emacs</code> control my downloaded music, and thats where I found <a href="https://www.gnu.org/software/emms/">EMMS</a>.
</p>
</div>
</div>

<div id="outline-container-org47d1cc1" class="outline-3">
<h3 id="org47d1cc1">Setup</h3>
<div class="outline-text-3" id="text-org47d1cc1">
<p>
Being an <code>Emacs</code> package, it's reasonably easy to install, however EMMS uses the <code>mpd/mpc</code> external programs to control and play music, Trying this a couple of months ago I actually gave up. Now however I think I have a repetable process.
</p>
<ol class="org-ol">
<li><p>
Install <code>mpd/mpc</code> on your system, for me this was done like so.
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo apt update &amp;&amp; <span style="font-style: italic;">\</span>
    sudo apt install mpc mpd -y 
</pre>
</div></li>
<li><p>
Next make the <code>mpd</code> files.
</p>
<div class="org-src-container">
<pre class="src src-shell">ls ~/.mpd/
</pre>
</div>

<pre class="example">
database
log
mpd.conf
mpd.db
mpd.log
mpd.pid
pid
playlists
</pre></li>
<li><p>
Configure <code>Pulse Audio</code> in the <code>~/.mpd/mpd.conf</code> file.   
</p>
<pre class="example" id="org0ee3333">
audio_output {
	type		"pulse"
	name		"My Pulse Output"
	server		"localhost"		# optional
##	sink		"remote_server_sink"	# optional
}
</pre>
<p>
This <a href="https://help.ubuntu.com/community/MPD">page</a> helped alot with the <code>mpd/mpc</code> side of things.
</p></li>
<li><p>
Install the <code>emms</code> package in <code>Emacs</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emms
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">emms-setup</span>)
  (emms-standard)
  (emms-default-players)
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">emms-mode-line</span>)
  (emms-mode-line 1)
  )
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-orgd8b20b4" class="outline-3">
<h3 id="orgd8b20b4">Usage</h3>
<div class="outline-text-3" id="text-orgd8b20b4">
<p>
This is <code>Emacs</code> so the usage is whatever you want it to be, I personally doing <code>M-x emms-play-directory RET</code> works best for me, but <code>EMMS</code> has loads more features that I'm yet to discover.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
